#
# Создайте список случайных чисел, со случайным количеством элементов от 3 до 10.
# Ваша задача - создать новый список из 3 элементов начального списка - первым, третьим и вторым с конца .
# Пример:
# [1, 2, 3, 4, 5, 6, 7, 9] == [1, 3, 7]
# [1, 1, 1, 1] == [1, 1, 1]
# [6, 3, 7] == [6, 7, 3]


from random import randint


for _ in range(5):
    lst = [randint(1, 20) for i in range(randint(3, 10))]
    print(lst, '----->', [lst[0], lst[2], lst[-2]])