#Пользователь вводит 4-хзначное число с клавиатуры.
#Написать программу, которая выводит цифры, из которого это число состоит.
#Например пользователь вводит 1234, а программа выводит:
#1
#2
#3
#4
#Задачу необходимо решить используя методы деления (подсказка // и % или divmod).
#Пользователь может ввести любое 4-х значное число. Ваше решение должно это учитывать!
#Число ВСЕГДА 4-хзначное!


users_number = int(input())

print(users_number // 1000)
print((users_number // 100) % 10)
print((users_number // 10) % 10)
print(users_number  % 10)